app/controllers/timers_controller.rb

  def top
    @timer = Timer.first_or_initialize
    @timer.status = 0 if @timer.new_record? || @timer.status.nil?
    @timer.save if @timer.new_record?
---
SELECT "timers".* FROM "timers" ORDER BY "timers"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "timers" ("work_duration", "break_duration", "work_or_break", "start_time", "end_time", "status", "sum_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def reset
    @timer = Timer.first_or_create(work_duration: 25, break_duration: 5)
---
SELECT "timers".* FROM "timers" ORDER BY "timers"."id" ASC LIMIT $1  [["LIMIT", 1]]